Repository: region23/Battry
Catalog: Battry/*.lproj/Localizable.strings
Languages: ru

source: Charging
ru: Заряжается

# power.ac
source: Power Adapter
ru: Питание от сети

# power.battery
source: On Battery
ru: От батареи

# health.status.excellent
source: Excellent
ru: Отлично

# health.status.normal
source: Normal
ru: Нормально

# health.status.acceptable
source: Acceptable
ru: Приемлемо

# health.status.poor
source: Poor
ru: Плохо

# time.remaining
source: ~ %@ remaining (macOS data)
ru: Осталось ~ %@ (по данным macOS)

# time.to.full
source: ~ %@ to full (macOS data)
ru: До 100% ~ %@ (по данным macOS)

source: Cycles
ru: Циклы

source: Wear
ru: Износ

source: Voltage
ru: Напряжение

source: Temperature
ru: Температура

# temperature.tooltip
source: Battery temperature
ru: Температура батареи

# temperature.warning.title
source: High Temperature Warning
ru: Предупреждение о высокой температуре

# temperature.warning.text
source: Battery temperature is above %.0f°C. The test will continue but monitor the temperature.
ru: Температура батареи выше %.0f°C. Тест продолжается, но следите за температурой.

# discharge.per.hour
source: Discharge, %/h
ru: Разряд, %/ч

# discharge.per.hour.1h
source: Discharge (1h)
ru: Разряд (1 час)

# discharge.per.hour.24h
source: Discharge (24h)
ru: Разряд (24 часа)

# discharge.per.hour.7d
source: Discharge (7d)
ru: Разряд (7 дней)

# collecting.stats
source: collecting data...
ru: копим статистику...

# analysis.intro
source: Battery life test (CP discharge 100%→5%): get reproducible runtime and a report.
ru: Тест автономности (CP‑разряд 100%→5%): получим воспроизводимое время работы и отчёт.

# analysis.start
source: Start Battery Life Test
ru: Начать тест автономности

# analysis.waiting.full
source: Charge to 100% and unplug. Analysis will start automatically.
ru: Зарядите до 100% и отключите питание. Анализ стартует автоматически.

# analysis.unplug.to.start
source: Unplug power to start the test.
ru: Отключите питание для начала теста.

# analysis.charge.to.percent
source: Charge %d%%. Charge to 100% and unplug power.
ru: Заряд %d%%. Зарядите до 100% и отключите питание.

source: Current charge:
ru: Текущий заряд:

source: Cancel
ru: Отмена

source: Analysis running…
ru: Идёт анализ…

# analysis.target
source: Target: 5% (do not plug in)
ru: Цель: 5% (не подключайте питание)

source: ETA: %@
ru: Осталось: %@

# eta.end.at
source: Ends ~ %@
ru: Окончание ~ %@

# eta.note
source: Time is approximate and adjusts as logs are collected.
ru: Время примерное; уточняется по мере сбора логов.

# eta.pending
source: Estimated time will appear later — collecting data.
ru: Расчётное время появится позже — пока собираем данные.

source: Stop
ru: Прервать

# analysis.paused
source: Analysis paused: power connected. Unplug and charge to 100% to restart.
ru: Анализ на паузе: питание подключено. Отключите питание и зарядите до 100% для перезапуска.

# analysis.done
source: Analysis completed
ru: Анализ завершён

# duration.hours
source: Duration: %@ h
ru: Длительность: %@ ч

# avg.discharge.per.hour.val
source: Avg discharge: %@ %%/h
ru: Средний разряд: %@ %/ч

# runtime.100.0.val
source: Estimated 100→0%: %@ h
ru: Оценка 100→0%: %@ ч

# open.report
source: Open HTML Report
ru: Открыть HTML‑отчёт

# analysis.repeat
source: Repeat Analysis
ru: Повторить анализ

source: Reset
ru: Сбросить

source: Last Result
ru: Последний результат

# last.result.line
source: Avg: %@ %%/h • Runtime: %@ h
ru: Средний: %@ %/ч • Автономность: %@ ч

source: Recent Analyses
ru: Последние анализы

# recent.line
source: %@ → %@ • %@ %%/h
ru: %@ → %@ • %@ %/ч

# analysis.results
source: Test Results
ru: Результаты тестов

# analysis.results.empty
source: No results yet. Run a battery life test (100%→5%) or a quick health test to see results here.
ru: Результатов пока нет. Выполните тест автономности (100%→5%) или быстрый тест здоровья, чтобы увидеть результаты здесь.

# analysis.results.empty.with.report
source: No results yet. Run a battery life test (100%→5%) or a quick health test to see results and reports here.
ru: Результатов пока нет. Выполните тест автономности (100%→5%) или быстрый тест здоровья, чтобы увидеть результаты и отчёты здесь.

# panel.overview
source: Overview
ru: Обзор

# panel.charts
source: Charts
ru: Графики

# panel.analysis
source: Analysis
ru: Анализ

# process.step.prepare
source: Prepare
ru: Подготовка

# process.step.charge
source: Charge
ru: Зарядка

# process.step.test
source: Test
ru: Тест

# process.step.results
source: Results
ru: Результаты

# discharge.rate
source: Discharge
ru: Разряд

# runtime.estimated
source: Runtime
ru: Время работы

# analysis.auto.reset
source: A long gap was detected. Analysis was reset and will start again at 99–100% on battery.
ru: Обнаружен большой разрыв в данных. Анализ сброшен и начнётся заново при 99–100% на батарее.

source: Got it
ru: Понятно

# panel.trends
source: Trends
ru: Тренды

# panel.test
source: Test
ru: Анализ

# panel.settings
source: Settings
ru: Настройки

source: Health
ru: Здоровье

source: Analysis Summary
ru: Итог анализа

# avg.discharge.per.hour.7d
source: Discharge (7d)
ru: Разряд (7 дней)

source: Runtime
ru: Автономность

# capacity.fact.design
source: Capacity
ru: Ёмкость

# badge.normal
source: Normal
ru: Норма

# badge.hot
source: Hot
ru: Жарко

# badge.high.load
source: High
ru: Высокая

source: Start Test
ru: Начать анализ

source: Cancel Test
ru: Отменить тест

source: Save to Report
ru: Сохранить в отчёт

# precheck.title
source: Before starting, please check
ru: Перед стартом проверьте

# precheck.brightness
source: Set brightness to a fixed level (not auto)
ru: Задайте фиксированную яркость (не авто)

# precheck.background
source: Close heavy background apps
ru: Закройте тяжёлые фоновые приложения

# precheck.load
source: Avoid extra apps; use the generator below for a stable profile
ru: Не запускайте лишние приложения; для стабильного профиля используйте генератор ниже

# precheck.network
source: Consider going offline for best results
ru: Рассмотрите отключение от Wi-Fi сети для лучших результатов

# precheck.temperature
source: Ensure ambient temperature is moderate
ru: Убедитесь, что температура окружающей среды умеренная

# precheck.load.generator
source: Load generator will create consistent power draw
ru: Генератор нагрузки создаст стабильное потребление энергии

# trends.series.charge
source: Charge %
ru: Заряд %

# trends.series.temperature
source: Temperature
ru: Температура

# trends.series.voltage
source: Voltage V
ru: Напряжение V

# trends.series.drain
source: Discharge %/h
ru: Разряд %/ч

# trends.series.power
source: Power
ru: Мощность

# trends.series.soh.energy
source: SOH Energy
ru: SOH Энергии

# trends.series.health.score
source: Health Score
ru: Индекс здоровья

source: Health Score
ru: Индекс здоровья

source: Battery Condition
ru: Состояние батареи

# average.power.15min
source: Power (15 min)
ru: Средняя мощность (15 мин)

# preset.light
source: Light ~5W
ru: Лёгкая (~5 Вт)

# preset.medium
source: Medium ~10W
ru: Средняя (~10 Вт)

# preset.heavy
source: Heavy ~15W
ru: Тяжёлая (~15 Вт)

# power.presets
source: Runtime estimates
ru: Пресеты нагрузки

# avg.discharge.per.hour.short
source: Avg: %@ %%/h
ru: Средний: %@ %/ч

# avg.power.watts
source: Avg %sW
ru: Ср %sВт

# power.level.light
source: Light (<5W)
ru: Лёгкая (<5Вт)

# power.level.medium
source: Medium (5-10W)
ru: Средняя (5-10Вт)

# power.level.heavy
source: Heavy (>10W)
ru: Тяжёлая (>10Вт)

# trend.discharge.per.hour.short
source: Trend: %@ %%/h
ru: Тренд: %@ %/ч

# health.zone.excellent
source: Excellent (≥85)
ru: Отлично (≥85)

# health.zone.acceptable
source: Acceptable (70-85)
ru: Приемлемо (70-85)

# health.zone.poor
source: Poor (<70)
ru: Плохо (<70)

# micro.drops.count
source: Micro-drops: %d
ru: Микро-дропы: %d

# soh.energy.percent
source: SOH Energy: %s%%
ru: SOH Энергии: %s%%

# health.recommendation.excellent
source: Battery in excellent condition.
ru: Аккумулятор в отличном состоянии.

# health.recommendation.acceptable
source: Acceptable condition. Monitor regularly.
ru: Приемлемое состояние. Контролируйте регулярно.

# health.recommendation.poor
source: Plan battery replacement. Avoid high loads.
ru: Планируйте замену аккумулятора. Избегайте высоких нагрузок.

# health.recommendation.critical
source: Battery replacement required soon.
ru: Требуется замена аккумулятора в ближайшее время.

# charging.shade
source: Charging
ru: Зарядка

source: Micro-drop
ru: Микро‑просадка

# status.tooltip.hot
source: High temperature
ru: Высокая температура

# status.tooltip.charging
source: Charging
ru: Зарядка

# status.tooltip.low
source: Low battery
ru: Низкий заряд

# status.tooltip.medium
source: Medium battery
ru: Средний заряд

# status.tooltip.ok
source: Normal
ru: Нормально

# tooltip.time.remaining.header
source: System estimate to 0% based on current load (macOS). May vary quickly.
ru: Системная оценка до 0% по текущей нагрузке (macOS). Может меняться быстро.

# tooltip.time.remaining.test
source: Session-based estimate to 5% from measured average discharge since start. More stable.
ru: Оценка по сессии до 5% на основе измеренного среднего разряда. Более стабильна.

source: Settings
ru: Настройки

# settings.language
source: Language
ru: Язык

# settings.data
source: Data
ru: Данные

# settings.data.entries.label
source: Entries
ru: Записей

# settings.data.size.label
source: Size
ru: Объём

# settings.data.clear
source: Delete accumulated statistics
ru: Удалить накопленную статистику

# settings.data.confirm
source: Delete all accumulated statistics? This cannot be undone.
ru: Удалить всю накопленную статистику? Это действие необратимо.

# settings.general
source: General Settings
ru: Основные настройки

# settings.language.description
source: Application interface language
ru: Язык интерфейса приложения

# settings.data.entries.description
source: Number of saved monitoring records
ru: Количество сохранённых записей мониторинга

# settings.data.size.description
source: Total size of data files on disk
ru: Общий размер файлов данных на диске

# settings.data.danger.zone
source: Danger Zone
ru: Опасная зона

# overview.battery.info
source: Battery Information
ru: Характеристики батареи

# overview.performance
source: Performance
ru: Производительность

source: After test
ru: После теста

# overview.anomalies
source: Anomalies
ru: Аномалии

# overview.recommendation
source: Recommendation
ru: Рекомендация

# trends.timeframe
source: Time Range
ru: Период времени

# trends.metrics
source: Display Metrics
ru: Показывать метрики

# calibration.auto.reset.title
source: Session Reset
ru: Сессия сброшена

# calibration.start.test
source: Battery Life Test
ru: Тест автономности

# calibration.waiting.title
source: Waiting for Full Charge
ru: Ожидание полного заряда

# calibration.battery.ready
source: Battery Ready
ru: Батарея заряжена

# calibration.running.title
source: Test Running
ru: Выполняется тест

# calibration.paused.title
source: Test Paused
ru: Тест приостановлен

# calibration.completed.title
source: Test Completed
ru: Тест завершён

# calibration.started.at
source: Started at
ru: Начато в

# calibration.start.percent
source: Starting charge
ru: Стартовый заряд

# calibration.progress
source: Progress
ru: Прогресс

# calibration.duration
source: Duration
ru: Длительность

# calibration.avg.discharge
source: Avg discharge
ru: Средний разряд

# calibration.estimated.runtime
source: Estimated runtime
ru: Расчётная автономность

# timeframe.session
source: Last Session
ru: Последний сеанс

# timeframe.h24
source: 24h
ru: 24ч

# timeframe.d7
source: 7d
ru: 7д

# timeframe.d30
source: 30d
ru: 30д

source: About
ru: О программе

# about.subtitle
source: macOS Battery Health Monitoring
ru: Мониторинг состояния батареи macOS

# about.developer
source: Developed by @region23
ru: Навайбкодил @region23

# about.source.code
source: Source Code
ru: Исходный код

# about.download
source: Download
ru: Скачать

# about.latest.version
source: Latest Version
ru: Последняя версия

# about.channel.title
source: Subscribe to my channel
ru: Подписывайтесь на канал

# about.channel.description
source: Where I write about AI and AI-powered development
ru: Там я пишу про AI и разработку с помощью AI

# about.copyright
source: © 2025 Developed with ❤️ for the macOS community
ru: © 2025 Разработано с ❤️ для macOS сообщества

source: Quit
ru: Выйти

# calibration.stop.title
source: Stop Test?
ru: Прервать тест?

# calibration.stop.confirm
source: The test has been running for some time. Are you sure you want to stop it? All progress will be lost.
ru: Тест выполняется уже некоторое время. Вы уверены, что хотите его прервать? Весь прогресс будет потерян.

# calibration.continue
source: Continue Test
ru: Продолжить тест

# calibration.stop.button
source: Stop Test
ru: Прервать тест

source: OK
ru: ОК

# load.generator.title
source: Power Stabilization (CP)
ru: Стабилизация мощности (CP)

# advanced.settings.title
source: Advanced Settings
ru: Дополнительные настройки

# load.generator.enable
source: Enable load generator
ru: Включить генератор нагрузки

# load.generator.profile
source: Profile
ru: Профиль

# load.generator.auto.start
source: Auto-start with test
ru: Автозапуск с тестом

# load.generator.status
source: Generator Status
ru: Статус генератора

# load.generator.pause
source: Pause
ru: Пауза

# load.generator.stopped
source: Stopped
ru: Остановлен

# load.generator.running.profile
source: Running: %@
ru: Запущен: %@

# load.profile.light
source: Light
ru: Лёгкий

# load.profile.medium
source: Medium
ru: Средний

# load.profile.heavy
source: Heavy
ru: Тяжёлый

# load.profile.custom
source: Custom
ru: Настраиваемый

# load.stop.battery.text
source: Auto-stopped: low battery (%d%%)
ru: Автостоп: низкий заряд (%d%%)

# load.stop.temperature.text
source: Auto-stopped: high temperature (%.1f°C)
ru: Автостоп: высокая температура (%.1f°C)

# update.available
source: New version available
ru: Доступна новая версия

# update.download
source: Download
ru: Скачать

# update.check
source: Check for updates
ru: Проверить обновления

# update.checking
source: Checking...
ru: Проверяю...

# update.latest
source: You have the latest version
ru: У вас последняя версия

# update.error
source: Check failed
ru: Ошибка проверки

# update.error.network
source: Network error
ru: Ошибка сети

# update.error.no.internet
source: No internet connection
ru: Нет подключения к интернету

# update.error.cannot.reach.github
source: Cannot reach GitHub
ru: Нет доступа к GitHub

# update.error.timeout
source: Request timeout
ru: Таймаут запроса

# update.available.short
source: available
ru: доступна

# load.stop.thermal.text
source: Auto-stopped: thermal pressure (%@)
ru: Автостоп: тепловое давление (%@)

# load.stop.power.text
source: Auto-stopped: power connected
ru: Автостоп: подключено питание

# load.stop.charging.text
source: Auto-stopped: charging started
ru: Автостоп: начата зарядка

# thermal.serious
source: serious
ru: серьёзное

# thermal.critical
source: critical
ru: критическое

# safety.violation.battery
source: Stopped: battery level %d%%
ru: Остановлено: заряд %d%%

# safety.violation.temperature
source: Stopped: temperature %.1f°C
ru: Остановлено: температура %.1f°C

# safety.violation.thermal
source: Stopped: thermal pressure (%@)
ru: Остановлено: тепловое давление (%@)

# safety.violation.power
source: Stopped: power connected
ru: Остановлено: подключено питание

# safety.violation.charging
source: Stopped: charging started
ru: Остановлено: началась зарядка

# video.error.file.not.found
source: Video file not found
ru: Видео файл не найден

# video.error.player.item
source: Failed to create player item
ru: Не удалось создать элемент плеера

# video.error.player.creation
source: Failed to create video player
ru: Не удалось создать видео плеер

# video.error.unknown
source: Unknown video error: %@
ru: Неизвестная ошибка видео: %@

# video.error.file.recovery
source: Try reinstalling the application
ru: Попробуйте переустановить приложение

# video.error.restart.recovery
source: Try restarting the video load
ru: Попробуйте перезапустить видео нагрузку

# video.error.general.recovery
source: Try disabling video load
ru: Попробуйте отключить видео нагрузку

# heavy.profile.warning.title
source: Heavy Load Warning
ru: Предупреждение о высокой нагрузке

# heavy.profile.warning.message
source: Heavy profile uses all CPU cores at 80% intensity. This will generate significant heat and may trigger thermal throttling. Use only for stress testing.
ru: Тяжёлый профиль использует все ядра процессора на 80% интенсивности. Это создаст значительное тепловыделение и может вызвать термотроттлинг. Используйте только для стресс-тестирования.

# heavy.profile.warning.continue
source: Use Heavy Profile
ru: Использовать тяжёлый профиль

# heavy.profile.warning.cancel
source: Cancel
ru: Отмена

# settings.show.percentage
source: Show percentage in menu bar
ru: Показывать процент в меню баре

# settings.show.percentage.description
source: Display battery percentage next to icon
ru: Отображать процент заряда рядом с иконкой

# settings.data.open.folder
source: Open data folder
ru: Открыть папку с данными

# settings.data.open.folder.description
source: Open folder containing all collected data files
ru: Открыть папку со всеми собранными файлами данных

source: Power Consumption
ru: Потребление мощности

# tooltip.power.discharging
source: Power being consumed from battery
ru: Мощность, потребляемая от батареи

# tooltip.power.charging
source: Power being supplied to charge battery
ru: Мощность, подаваемая для зарядки батареи

source: SOH Energy
ru: SOH (по энергии)

# dcir.50.percent
source: Internal Resistance @ 50%
ru: Внутр. сопротивление @ 50%

# dcir.20.percent
source: Internal Resistance @ 20%
ru: Внутр. сопротивление @ 20%

# knee.soc
source: OCV Knee Point
ru: Точка колена OCV

source: Knee Index
ru: Качество вольт-кривой

source: Quick Health Test
ru: Быстрый тест здоровья

# health.score.composite
source: Composite Health Score
ru: Композитный индекс здоровья

# power.preset.selection
source: Power Preset
ru: Пресет мощности

source: Constant Power Mode
ru: Режим постоянной мощности

source: Target Power
ru: Целевая мощность

source: Current Power
ru: Текущая мощность

# power.control.quality
source: Control Quality
ru: Качество контроля

# temperature.normalization
source: Temperature Normalized
ru: Температурно нормализовано

source: CP Discharge
ru: CP разряд

source: Expert Metrics
ru: Состояние батареи

# dcir.resistance
source: DCIR @50%
ru: Быстродействие

source: Micro-drops
ru: Стабильность заряда

source: Show Details
ru: Показать детали

source: Hide Details
ru: Скрыть детали

# temperature.status.normal
source: Normal
ru: Норма

# temperature.status.high
source: High
ru: Высокая
